---
kind: other
id: Properties.T:Autodesk.Revit.UI.UISaveAsOptions
source: html/1d23020f-aa21-f9b7-5be2-711af82df6a7.htm
---
# UISaveAsOptions Properties

Specifies whether the .NET object represents a valid Revit entity.